schwinn/NMEA2000_STM32X/src/NMEA2000_STM32X.cpp
#include "NMEA2000_STM32X.h"
#include "core_debug.h"

// ===========================================================================
// Common helper function
// ===========================================================================
extern void CanIdToN2k(unsigned long id, unsigned char &prio, unsigned long &pgn,
                       unsigned char &src, unsigned char &dst);

// ===========================================================================
//  bxCAN – specific code
// ===========================================================================
#if defined(STM32X_USE_BXCAN)

#if defined(HAL_CEC_MODULE_ENABLED) && defined(STM32_CAN1_SHARED_WITH_CEC)
extern CEC_HandleTypeDef *phcec;
#endif

#define STM32_CAN_CAN2_FILTER_OFFSET 14
#define MAX_IRQ_PRIO_VALUE ((1UL << __NVIC_PRIO_BITS) - 1UL)

constexpr Baudrate_entry_t tNMEA2000_STM32X::BAUD_RATE_TABLE_48M[];
constexpr Baudrate_entry_t tNMEA2000_STM32X::BAUD_RATE_TABLE_45M[];
constexpr Baudrate_entry_t tNMEA2000_STM32X::BAUD_RATE_TABLE_42M[];
constexpr Baudrate_entry_t tNMEA2000_STM32X::BAUD_RATE_TABLE_36M[];

typedef enum
{
#ifdef CAN1
  CAN1_INDEX,
#endif
#ifdef CAN2
  CAN2_INDEX,
#endif
#ifdef CAN3
  CAN3_INDEX,
#endif
  CAN_NUM,
  CAN_UNKNOWN = 0xFFFF
} can_index_t;

static stm32_can_t *canObj[CAN_NUM] = {NULL};

static stm32_can_t *get_can_obj(CAN_HandleTypeDef *hcan)
{
  return (stm32_can_t *)((char *)hcan - offsetof(stm32_can_t, handle));
}

static can_index_t get_can_index(CAN_TypeDef *instance)
{
  can_index_t index = CAN_UNKNOWN;
#if defined(CAN1)
  if (instance == CAN1)
    index = CAN1_INDEX;
#endif
#if defined(CAN2)
  if (instance == CAN2)
    index = CAN2_INDEX;
#endif
#if defined(CAN3)
  if (instance == CAN3)
    index = CAN3_INDEX;
#endif
  if (index == CAN_UNKNOWN)
    Error_Handler();
  return index;
}

bool tNMEA2000_STM32X::allocatePeripheral(CAN_TypeDef *instance)
{
  can_index_t index = get_can_index(instance);
  if (index >= CAN_NUM)
    return false;
  if (canObj[index])
  {
    Error_Handler();
    return false;
  }
  _can.handle.Instance = instance;
  canObj[index] = &_can;
  return true;
}

bool tNMEA2000_STM32X::freePeripheral()
{
  if (_can.handle.Instance == nullptr)
    return false;
  can_index_t index = get_can_index(_can.handle.Instance);
  if (index >= CAN_NUM)
    return false;
  if (canObj[index] == &_can)
  {
    canObj[index] = nullptr;
    _can.handle.Instance = nullptr;
    return true;
  }
  Error_Handler();
  return false;
}

bool tNMEA2000_STM32X::hasPeripheral()
{
  if (_can.handle.Instance == nullptr)
    return false;
  can_index_t index = get_can_index(_can.handle.Instance);
  if (index >= CAN_NUM)
    return false;
  return canObj[index] == &_can;
}

// --- Constructors (bxCAN) ---
tNMEA2000_STM32X::tNMEA2000_STM32X(uint32_t rx, uint32_t tx)
    : rxRing1(0), txRing1(0),
      preemptPriority(MAX_IRQ_PRIO_VALUE), subPriority(0),
      IsOpen(false), tNMEA2000()
{
  this->rx = digitalPinToPinName(rx);
  this->tx = digitalPinToPinName(tx);
  init();
}

tNMEA2000_STM32X::tNMEA2000_STM32X(CAN_TypeDef *canPort)
    : rxRing1(0), txRing1(0),
      preemptPriority(MAX_IRQ_PRIO_VALUE), subPriority(0),
      IsOpen(false), tNMEA2000()
{
  rx = pinmap_find_pin(canPort, PinMap_CAN_RD);
  tx = pinmap_find_pin(canPort, PinMap_CAN_TD);
  init();
}

#endif // STM32X_USE_BXCAN

// ===========================================================================
//  FDCAN – specific code (static instance + global pointer)
// ===========================================================================
#if defined(STM32X_USE_FDCAN)

FDCAN_HandleTypeDef tNMEA2000_STM32X::hcan_ = {};
static tNMEA2000_STM32X *g_canInstance = nullptr;

#endif // STM32X_USE_FDCAN

// ===========================================================================
//  Common constructor (PinName) and destructor
// ===========================================================================
tNMEA2000_STM32X::tNMEA2000_STM32X(PinName rx, PinName tx)
    : rx(rx), tx(tx), rxRing1(nullptr), txRing1(nullptr),
      IsOpen(false), tNMEA2000()
{
#if defined(STM32X_USE_BXCAN)
  preemptPriority = MAX_IRQ_PRIO_VALUE;
  subPriority = 0;
#endif
  init();
}

tNMEA2000_STM32X::~tNMEA2000_STM32X()
{
  end();
}

// ===========================================================================
//  tNMEA2000 overrides – shared
// ===========================================================================

bool tNMEA2000_STM32X::CANOpen()
{
  if (IsOpen)
    return true;
  IsOpen = true;
  begin();
  return IsOpen;
}

void tNMEA2000_STM32X::InitCANFrameBuffers()
{

  if (MaxCANReceiveFrames == 0)
    MaxCANReceiveFrames = 60;
  if (MaxCANReceiveFrames < 30)
    MaxCANReceiveFrames = 30;
  if (MaxCANSendFrames == 0)
    MaxCANSendFrames = 80;
  if (MaxCANSendFrames < 50)
    MaxCANSendFrames = 50;

  if (rxRing1 != nullptr && rxRing1->getSize() != MaxCANReceiveFrames)
  {
    delete rxRing1;
    rxRing1 = nullptr;
  }
  if (txRing1 != nullptr && txRing1->getSize() != MaxCANSendFrames)
  {
    delete txRing1;
    txRing1 = nullptr;
  }

  if (rxRing1 == nullptr)
    rxRing1 = new tPriorityRingBuffer<CAN_message_t>(MaxCANReceiveFrames, 8);
  if (txRing1 == nullptr)
    txRing1 = new tPriorityRingBuffer<CAN_message_t>(MaxCANSendFrames, 8);
}

// ---------------------------------------------------------------------------
bool tNMEA2000_STM32X::CANSendFrame(unsigned long id, unsigned char len,
                                    const unsigned char *buf, bool /*wait_sent*/)
{
  uint8_t prio = (id >> 26) & 0x7;
  uint8_t dlc = (len > 8) ? 8 : len;

#if defined(STM32X_USE_FDCAN)
  __HAL_FDCAN_DISABLE_IT(&hcan_, FDCAN_IT_TX_COMPLETE);
  __HAL_FDCAN_DISABLE_IT(&hcan_, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);
  bool mailboxBusy = (HAL_FDCAN_GetTxFifoFreeLevel(&hcan_) == 0);

  FDCAN_TxHeaderTypeDef TxHeader = {
      .Identifier = id & 0x1FFFFFFFU,
      .IdType = FDCAN_EXTENDED_ID,
      .TxFrameType = FDCAN_DATA_FRAME,
      .DataLength = lengthToDLC(dlc),
      .FDFormat = FDCAN_CLASSIC_CAN,
      .MessageMarker = 0};
#else // bxCAN
  if (!_can.handle.Instance)
    return false;
#if !defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB)
  __HAL_CAN_DISABLE_IT(&_can.handle, CAN_IT_TX_MAILBOX_EMPTY);
  __HAL_CAN_DISABLE_IT(&_can.handle, CAN_IT_RX_FIFO0_MSG_PENDING);
#endif
  bool mailboxBusy = (HAL_CAN_GetTxMailboxesFreeLevel(&_can.handle) == 0);
  uint32_t TxMailbox;

