schwinn/NMEA2000_STM32X/src/NMEA2000_STM32X.cpp
  CAN_TxHeaderTypeDef TxHeader = {
      .ExtId = id,
      .IDE = CAN_ID_EXT,
      .RTR = CAN_RTR_DATA,
      .DLC = dlc,
      .TransmitGlobalTime = DISABLE};
#endif

#if defined(STMCANDEBUG)
  {
    unsigned long pgn;
    unsigned char src, dst;
    CanIdToN2k(id, prio, pgn, src, dst);
    Serial.printf("CANSendFrame pgn:%6lu, prio:%u, src:%u, dst:%u, data:%02X %02X\n",
                  pgn, prio, src, dst, buf[0], buf[1]);
  }
#endif

  bool sendFromBuffer = false;
  if (!txRing1->isEmpty() || mailboxBusy)
  {
    CAN_message_t *msg = txRing1->getAddRef(prio);
    if (msg)
    {
      msg->id = id;
      msg->len = dlc;
      memcpy(msg->buf, buf, dlc);
    }
    sendFromBuffer = true;
  }

  bool result = true;
  if (!mailboxBusy)
  {
    if (sendFromBuffer)
    {
      sendFromTxRing();
    }
    else
    {
#if defined(STM32X_USE_FDCAN)
      if (HAL_FDCAN_AddMessageToTxFifoQ(&hcan_, &TxHeader, buf) != HAL_OK)
        result = false;
#else
      if (HAL_CAN_AddTxMessage(&_can.handle, &TxHeader, buf, &TxMailbox) != HAL_OK)
        result = false;
#endif
    }
  }

#if defined(STM32X_USE_FDCAN)
  __HAL_FDCAN_ENABLE_IT(&hcan_, FDCAN_IT_TX_COMPLETE);
  __HAL_FDCAN_ENABLE_IT(&hcan_, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);
#else
#if !defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB)
  __HAL_CAN_ENABLE_IT(&_can.handle, CAN_IT_TX_MAILBOX_EMPTY);
  __HAL_CAN_ENABLE_IT(&_can.handle, CAN_IT_RX_FIFO0_MSG_PENDING);
#endif
#endif

  return result;
}

// ---------------------------------------------------------------------------
bool tNMEA2000_STM32X::sendFromTxRing()
{
  const CAN_message_t *txMsg = txRing1->getReadRef();
  if (txMsg == nullptr)
    return false;

#if defined(STMCANDEBUG)
  {
    unsigned long pgn;
    unsigned char prio, src, dst;
    CanIdToN2k(txMsg->id, prio, pgn, src, dst);
    Serial.printf("sendFromTxRing pgn:%6lu, prio:%u, src:%u, dst:%u, data:%02X\n",
                  pgn, prio, src, dst, txMsg->buf[0]);
  }
#endif

#if defined(STM32X_USE_FDCAN)
  FDCAN_TxHeaderTypeDef TxHeader = {
      .Identifier = txMsg->id & 0x1FFFFFFFU,
      .IdType = FDCAN_EXTENDED_ID,
      .TxFrameType = FDCAN_DATA_FRAME,
      .DataLength = lengthToDLC(txMsg->len),
      .FDFormat = FDCAN_CLASSIC_CAN,
      .MessageMarker = 0};
  if (HAL_FDCAN_AddMessageToTxFifoQ(&hcan_, &TxHeader, txMsg->buf) != HAL_OK)
  {
#if defined(STMCANDEBUG)
    Serial.println("sendFromTxRing failed");
#endif
  }
#else // bxCAN
  CAN_TxHeaderTypeDef TxHeader;
  TxHeader.ExtId = txMsg->id;
  TxHeader.IDE = CAN_ID_EXT;
  TxHeader.RTR = CAN_RTR_DATA;
  TxHeader.DLC = txMsg->len;
  TxHeader.TransmitGlobalTime = DISABLE;
  uint32_t TxMailbox;
  if (HAL_CAN_AddTxMessage(&_can.handle, &TxHeader, txMsg->buf, &TxMailbox) != HAL_OK)
  {
#if defined(STMCANDEBUG)
    Serial.println("sendFromTxRing failed");
#endif
  }
#endif

  return true;
}

// ---------------------------------------------------------------------------
bool tNMEA2000_STM32X::CANGetFrame(unsigned long &id, unsigned char &len,
                                   unsigned char *buf)
{
#if defined(STM32X_USE_FDCAN)
  __HAL_FDCAN_DISABLE_IT(&hcan_, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);
#elif defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB) && defined(STM32_CAN_USB_WORKAROUND_POLLING)
  __HAL_CAN_DISABLE_IT(&_can.handle, CAN_IT_RX_FIFO1_MSG_PENDING);
#else
  __HAL_CAN_DISABLE_IT(&_can.handle, CAN_IT_RX_FIFO0_MSG_PENDING);
#endif

  bool ret = false;
  const CAN_message_t *msg = rxRing1->getReadRef();
  if (msg != nullptr)
  {
    id = msg->id;
    len = msg->len;
    if (len > 8)
      len = 8;
    memcpy(buf, msg->buf, len);
    ret = true;
  }

#if defined(STM32X_USE_FDCAN)
  __HAL_FDCAN_ENABLE_IT(&hcan_, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);
#elif defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB) && defined(STM32_CAN_USB_WORKAROUND_POLLING)
  __HAL_CAN_ENABLE_IT(&_can.handle, CAN_IT_RX_FIFO1_MSG_PENDING);
#else
  __HAL_CAN_ENABLE_IT(&_can.handle, CAN_IT_RX_FIFO0_MSG_PENDING);
#endif

#if defined(STMCANDEBUG)
  if (ret)
  {
    unsigned long pgn;
    unsigned char prio, src, dst;
    CanIdToN2k(id, prio, pgn, src, dst);
    Serial.printf("CANGetFrame pgn:%6lu, prio:%u, src:%u, dst:%u, data:%02X\n",
                  pgn, prio, src, dst, buf[0]);
  }
#endif

  return ret;
}

// ---------------------------------------------------------------------------
bool tNMEA2000_STM32X::addToRingBuffer(const CAN_message_t &msg)
{
  if (rxRing1 == nullptr)
    return false;
  uint8_t prio = (uint8_t)((msg.id >> 26) & 0x7);
  CAN_message_t *rxMsg = rxRing1->getAddRef(prio);
  if (rxMsg != nullptr)
  {
    *rxMsg = msg;
    return true;
  }
  return false;
}

// ===========================================================================
//  init() – peripheral-specific
// ===========================================================================
void tNMEA2000_STM32X::init()
{
#if defined(STM32X_USE_FDCAN)
  hcan_.Instance = FDCAN1;
  g_canInstance = this;
#else
  _can.__this = (void *)this;
  _can.handle.Instance = nullptr;
  baudrate = 250000UL;
  filtersInitialized = false;

  _can.handle.Init.TimeTriggeredMode = DISABLE;
  _can.handle.Init.AutoBusOff = ENABLE;
  _can.handle.Init.AutoWakeUp = DISABLE;
  _can.handle.Init.AutoRetransmission = ENABLE;
  _can.handle.Init.ReceiveFifoLocked = DISABLE;
  _can.handle.Init.TransmitFifoPriority = ENABLE;
  _can.handle.Init.Mode = CAN_MODE_NORMAL;
#endif
}

// ===========================================================================
//  begin() / end()
// ===========================================================================
void tNMEA2000_STM32X::begin()
{
#if defined(STM32X_USE_FDCAN)
#if defined(STMCANDEBUG)
  Serial.println("begin (FDCAN)");
#endif

  if (started_)
    return; // Can be called only once

  const int bitrate = 250000;

#if defined(RCC_PERIPHCLK_FDCAN1)
  uint32_t clockFreq = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_FDCAN1);
#elif defined(RCC_PERIPHCLK_FDCAN)
  uint32_t clockFreq = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_FDCAN);
#endif
#if defined(STMCANDEBUG)
  Serial.printf("CAN Clock: %d\n", clockFreq);
#endif

