schwinn/NMEA2000_STM32X/src/NMEA2000_STM32X.cpp
  CanTiming timing = solveCanTiming(clockFreq, bitrate);
  FDCAN_InitTypeDef *init = &hcan_.Init;
#ifndef STM32H7
  init->ClockDivider = FDCAN_CLOCK_DIV1;
#endif
  init->FrameFormat = FDCAN_CLASSIC_CAN;
  init->Mode = FDCAN_MODE_NORMAL;
  init->AutoRetransmission = ENABLE;
  init->TransmitPause = ENABLE;
  init->ProtocolException = DISABLE;

  init->NominalPrescaler = (uint16_t)timing.prescaler;
  init->NominalSyncJumpWidth = 1;
  init->NominalTimeSeg1 = timing.tseg1;
  init->NominalTimeSeg2 = timing.tseg2;

  init->DataPrescaler = (uint16_t)timing.prescaler;
  init->DataSyncJumpWidth = 1;
  init->DataTimeSeg1 = timing.tseg1;
  init->DataTimeSeg2 = timing.tseg2;

  init->StdFiltersNbr = 1;
  init->ExtFiltersNbr = 1;
  init->TxFifoQueueMode = FDCAN_TX_FIFO_OPERATION;

  pin_function(rx, pinmap_function(rx, PinMap_CAN_RD));
  pin_function(tx, pinmap_function(tx, PinMap_CAN_TD));

  if (HAL_FDCAN_Init(&hcan_) != HAL_OK)
  {
#if defined(STMCANDEBUG)
    Serial.println("HAL_FDCAN_Init Error");
#endif
  }

  started_ = true;
  applyFilter();

  if (HAL_FDCAN_Start(&hcan_) != HAL_OK)
  {
#if defined(STMCANDEBUG)
    Serial.println("HAL_FDCAN_Start Error");
#endif
  }

  subscribe();

#else // bxCAN ---------------------------------------------------------------
  if (_canIsActive)
    return;

  auto instance = getPeripheral();
  if (instance == NP)
    return;
  if (!allocatePeripheral(instance))
    return;
  _canIsActive = true;

  // Configure RX pin with pull-up
  uint32_t rx_func = pinmap_function(rx, PinMap_CAN_RD);
  rx_func = (rx_func & ~(STM_PIN_PUPD_MASK << STM_PIN_PUPD_SHIFT)) | (GPIO_PULLUP << STM_PIN_PUPD_SHIFT);
  pin_function(rx, fixPinFunction(rx_func));
  if (tx != NC)
    pin_function(tx, fixPinFunction(pinmap_function(tx, PinMap_CAN_TD)));

  // Clock and NVIC
  if (_can.handle.Instance == CAN1)
  {
    __HAL_RCC_CAN1_CLK_ENABLE();
#ifdef CAN1_IRQn_AIO
    HAL_NVIC_SetPriority(CAN1_IRQn_AIO, preemptPriority, subPriority);
    HAL_NVIC_EnableIRQ(CAN1_IRQn_AIO);
#else
#if defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB) && defined(STM32_CAN_USB_WORKAROUND_POLLING)
    HAL_NVIC_SetPriority(CAN1_RX1_IRQn, preemptPriority, subPriority);
    HAL_NVIC_EnableIRQ(CAN1_RX1_IRQn);
#else
    HAL_NVIC_SetPriority(CAN1_RX0_IRQn, preemptPriority, subPriority);
    HAL_NVIC_EnableIRQ(CAN1_RX0_IRQn);
    HAL_NVIC_SetPriority(CAN1_TX_IRQn, preemptPriority, subPriority);
    HAL_NVIC_EnableIRQ(CAN1_TX_IRQn);
#endif
#endif
    _can.bus = 1;
  }
#ifdef CAN2
  else if (_can.handle.Instance == CAN2)
  {
    __HAL_RCC_CAN1_CLK_ENABLE();
    __HAL_RCC_CAN2_CLK_ENABLE();
    HAL_NVIC_SetPriority(CAN2_RX0_IRQn, preemptPriority, subPriority);
    HAL_NVIC_EnableIRQ(CAN2_RX0_IRQn);
    HAL_NVIC_SetPriority(CAN2_TX_IRQn, preemptPriority, subPriority);
    HAL_NVIC_EnableIRQ(CAN2_TX_IRQn);
    _can.bus = 2;
  }
#endif
#ifdef CAN3
  else if (_can.handle.Instance == CAN3)
  {
    __HAL_RCC_CAN3_CLK_ENABLE();
    HAL_NVIC_SetPriority(CAN3_RX0_IRQn, preemptPriority, subPriority);
    HAL_NVIC_EnableIRQ(CAN3_RX0_IRQn);
    HAL_NVIC_SetPriority(CAN3_TX_IRQn, preemptPriority, subPriority);
    HAL_NVIC_EnableIRQ(CAN3_TX_IRQn);
    _can.bus = 3;
  }
#endif

  filtersInitialized = false;
  setBaudRate(baudrate);
#endif // STM32X_USE_FDCAN / STM32X_USE_BXCAN
}

// ---------------------------------------------------------------------------
void tNMEA2000_STM32X::end()
{
#if defined(STM32X_USE_FDCAN)
  if (HAL_FDCAN_Stop(&hcan_) != HAL_OK)
  {
  }
  if (HAL_FDCAN_DeInit(&hcan_) != HAL_OK)
  {
  }

  started_ = false;
#else
  if (!hasPeripheral())
    return;

  stop();
  disableMBInterrupts();

  if (_can.handle.Instance == CAN1)
    __HAL_RCC_CAN1_CLK_DISABLE();
#ifdef CAN2
  else if (_can.handle.Instance == CAN2)
  {
    __HAL_RCC_CAN2_CLK_DISABLE();
    if (canObj[CAN1_INDEX] == nullptr)
      __HAL_RCC_CAN1_CLK_DISABLE();
  }
#endif
#ifdef CAN3
  else if (_can.handle.Instance == CAN3)
    __HAL_RCC_CAN3_CLK_DISABLE();
#endif

  pin_function(rx, STM_PIN_DATA(STM_MODE_INPUT, GPIO_NOPULL, GPIO_AF_NONE));
  if (tx != NC)
    pin_function(tx, STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, GPIO_AF_NONE));

  freePeripheral();
  _canIsActive = false;
#endif
}

// ===========================================================================
//  applyFilter()
// ===========================================================================
void tNMEA2000_STM32X::applyFilter()
{
#if defined(STM32X_USE_FDCAN)

  HAL_FDCAN_ConfigGlobalFilter(&hcan_,
                               FDCAN_FILTER_REJECT,
                               FDCAN_FILTER_REJECT, 
                               FDCAN_FILTER_REMOTE,
                               FDCAN_FILTER_REMOTE);

  FDCAN_FilterTypeDef filter = {
      .IdType = FDCAN_EXTENDED_ID,
      .FilterIndex = 0,
      .FilterType = FDCAN_FILTER_RANGE, 
      .FilterConfig = FDCAN_FILTER_TO_RXFIFO0,
      .FilterID1 = 0x0000000,
      .FilterID2 = 0x1FFFFFFF, 
  };
  HAL_FDCAN_ConfigFilter(&hcan_, &filter);

#endif
}

// ===========================================================================
//  bxCAN – further lifecycle functions
// ===========================================================================
#if defined(STM32X_USE_BXCAN)

void tNMEA2000_STM32X::setIRQPriority(uint32_t preemptPriority, uint32_t subPriority)
{
  this->preemptPriority = min(preemptPriority, MAX_IRQ_PRIO_VALUE);
  this->subPriority = min(subPriority, MAX_IRQ_PRIO_VALUE);
}

void tNMEA2000_STM32X::setBaudRate(uint32_t baud)
{
  baudrate = baud;
  if (!hasPeripheral())
    return;
  if (!calculateBaudrate(baud))
    return;
  stop();
  start();
}

void tNMEA2000_STM32X::start()
{
  HAL_CAN_Init(&_can.handle);
  initializeFilters();
  HAL_CAN_Start(&_can.handle);
#if defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB) && defined(STM32_CAN_USB_WORKAROUND_POLLING)
  HAL_CAN_ActivateNotification(&_can.handle, CAN_IT_RX_FIFO1_MSG_PENDING);
#else
  HAL_CAN_ActivateNotification(&_can.handle, CAN_IT_RX_FIFO0_MSG_PENDING);
  HAL_CAN_ActivateNotification(&_can.handle, CAN_IT_TX_MAILBOX_EMPTY);
#endif
}

