schwinn/NMEA2000_STM32X/src/NMEA2000_STM32X.cpp
void tNMEA2000_STM32X::stop()
{
#if defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB) && defined(STM32_CAN_USB_WORKAROUND_POLLING)
  HAL_CAN_DeactivateNotification(&_can.handle, CAN_IT_RX_FIFO1_MSG_PENDING);
#else
  HAL_CAN_DeactivateNotification(&_can.handle, CAN_IT_RX_FIFO0_MSG_PENDING);
  HAL_CAN_DeactivateNotification(&_can.handle, CAN_IT_TX_MAILBOX_EMPTY);
#endif
  HAL_CAN_DeInit(&_can.handle);
}

bool tNMEA2000_STM32X::setFilterRaw(uint8_t bank_num, uint32_t id, uint32_t mask,
                                    uint32_t filter_mode, uint32_t filter_scale,
                                    FILTER_ACTION action, bool enabled)
{
  if (!_can.handle.Instance)
    return false;
  CAN_FilterTypeDef sFilterConfig;
  sFilterConfig.FilterBank = bank_num;
  sFilterConfig.FilterMode = filter_mode;
  sFilterConfig.FilterScale = filter_scale;

#if defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB) && defined(STM32_CAN_USB_WORKAROUND_POLLING)
  if (action == FILTER_ACTION::STORE_FIFO0)
    core_debug("WARNING: RX0 IRQ blocked by USB. Only RX1 events handled!\n");
#endif

  sFilterConfig.FilterFIFOAssignment =
      (action == FILTER_ACTION::STORE_FIFO0) ? CAN_FILTER_FIFO0 : CAN_FILTER_FIFO1;
  sFilterConfig.FilterActivation = enabled ? ENABLE : DISABLE;
  sFilterConfig.FilterIdLow = id & 0xFFFFUL;
  sFilterConfig.FilterIdHigh = id >> 16;
  sFilterConfig.FilterMaskIdLow = mask & 0xFFFFUL;
  sFilterConfig.FilterMaskIdHigh = mask >> 16;

#ifdef CAN2
  sFilterConfig.SlaveStartFilterBank = STM32_CAN_CAN2_FILTER_OFFSET;
  if (_can.handle.Instance == CAN2)
    sFilterConfig.FilterBank += STM32_CAN_CAN2_FILTER_OFFSET;
#endif

  return (HAL_CAN_ConfigFilter(&_can.handle, &sFilterConfig) == HAL_OK);
}

void tNMEA2000_STM32X::initializeFilters()
{
  if (filtersInitialized)
    return;
  filtersInitialized = true;
  setFilterRaw(0, 0UL, 0UL, CAN_FILTERMODE_IDMASK, CAN_FILTERSCALE_32BIT,
               FILTER_ACTION::CAN_FILTER_DEFAULT_ACTION, true);
}

CAN_TypeDef *tNMEA2000_STM32X::getPeripheral()
{
  CAN_TypeDef *canPort_rx = (CAN_TypeDef *)pinmap_peripheral(rx, PinMap_CAN_RD);
  CAN_TypeDef *canPort_tx = (CAN_TypeDef *)pinmap_peripheral(tx, PinMap_CAN_TD);
  if ((canPort_rx != canPort_tx && canPort_tx != NP) || canPort_rx == NP)
    return NP;
#ifdef STM32F1xx
  if (canPort_rx != NP && canPort_tx != NP)
  {
    if (STM_PIN_AFNUM(pinmap_function(rx, PinMap_CAN_RD)) !=
        STM_PIN_AFNUM(pinmap_function(tx, PinMap_CAN_TD)))
      return NP;
  }
#endif
  if (canPort_tx == NP)
    tx = NC;
  return canPort_rx;
}

uint32_t tNMEA2000_STM32X::fixPinFunction(uint32_t function)
{
#ifdef STM32F1xx
  uint32_t af = STM_PIN_AFNUM(function);
  if (af == AFIO_NONE)
    af = AFIO_CAN1_1;
  function &= ~(STM_PIN_AFNUM_MASK << STM_PIN_AFNUM_SHIFT);
  function |= ((af & STM_PIN_AFNUM_MASK) << STM_PIN_AFNUM_SHIFT);
#endif
  return function;
}

void tNMEA2000_STM32X::enableMBInterrupts()
{
  if (_can.handle.Instance == CAN1)
  {
#ifdef CAN1_IRQn_AIO
    HAL_NVIC_EnableIRQ(CAN1_IRQn_AIO);
#else
#if defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB) && defined(STM32_CAN_USB_WORKAROUND_POLLING)
    HAL_NVIC_EnableIRQ(CAN1_RX1_IRQn);
#else
    HAL_NVIC_EnableIRQ(CAN1_TX_IRQn);
    HAL_NVIC_EnableIRQ(CAN1_RX0_IRQn);
#endif
#endif
  }
#ifdef CAN2
  else if (_can.handle.Instance == CAN2)
  {
    HAL_NVIC_EnableIRQ(CAN2_TX_IRQn);
    HAL_NVIC_EnableIRQ(CAN2_RX0_IRQn);
  }
#endif
#ifdef CAN3
  else if (_can.handle.Instance == CAN3)
  {
    HAL_NVIC_EnableIRQ(CAN3_TX_IRQn);
    HAL_NVIC_EnableIRQ(CAN3_RX0_IRQn);
  }
#endif
}

void tNMEA2000_STM32X::disableMBInterrupts()
{
  if (_can.handle.Instance == CAN1)
  {
#ifdef CAN1_IRQn_AIO
#if defined(HAL_CEC_MODULE_ENABLED) && defined(STM32_CAN1_SHARED_WITH_CEC)
    if (!phcec)
#endif
    {
      HAL_NVIC_DisableIRQ(CAN1_IRQn_AIO);
    }
#else
#if defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB) && defined(STM32_CAN_USB_WORKAROUND_POLLING)
    HAL_NVIC_DisableIRQ(CAN1_RX1_IRQn);
#else
    HAL_NVIC_DisableIRQ(CAN1_TX_IRQn);
    HAL_NVIC_DisableIRQ(CAN1_RX0_IRQn);
#endif
#endif
  }
#ifdef CAN2
  else if (_can.handle.Instance == CAN2)
  {
    HAL_NVIC_DisableIRQ(CAN2_TX_IRQn);
    HAL_NVIC_DisableIRQ(CAN2_RX0_IRQn);
  }
#endif
#ifdef CAN3
  else if (_can.handle.Instance == CAN3)
  {
    HAL_NVIC_DisableIRQ(CAN3_TX_IRQn);
    HAL_NVIC_DisableIRQ(CAN3_RX0_IRQn);
  }
#endif
}

// --- Baudrate calculation (bxCAN) ---

uint32_t tNMEA2000_STM32X::getCanPeripheralClock()
{
  return HAL_RCC_GetPCLK1Freq(); // bxCAN clock is APB1/PCLK1 
}

void tNMEA2000_STM32X::setBaudRateValues(uint16_t prescaler, uint8_t timeseg1,
                                         uint8_t timeseg2, uint8_t sjw)
{
  uint32_t _SyncJumpWidth = 0;
  uint32_t _TimeSeg1 = 0;
  uint32_t _TimeSeg2 = 0;

  /* the CAN specification (v2.0) states that SJW shall be programmable between
   * 1 and min(4, timeseg1)
   */
  if (sjw > 4)
    sjw = 4;
  if (sjw > timeseg1)
    sjw = timeseg1;

  switch (sjw)
  {
  case 0:
  case 1:
    _SyncJumpWidth = CAN_SJW_1TQ;
    break;
  case 2:
    _SyncJumpWidth = CAN_SJW_2TQ;
    break;
  case 3:
    _SyncJumpWidth = CAN_SJW_3TQ;
    break;
  case 4:
  default:
    _SyncJumpWidth = CAN_SJW_4TQ;
    break;
  }

  switch (timeseg1)
  {
  case 1:
    _TimeSeg1 = CAN_BS1_1TQ;
    break;
  case 2:
    _TimeSeg1 = CAN_BS1_2TQ;
    break;
  case 3:
    _TimeSeg1 = CAN_BS1_3TQ;
    break;
  case 4:
    _TimeSeg1 = CAN_BS1_4TQ;
    break;
  case 5:
    _TimeSeg1 = CAN_BS1_5TQ;
    break;
  case 6:
    _TimeSeg1 = CAN_BS1_6TQ;
    break;
  case 7:
    _TimeSeg1 = CAN_BS1_7TQ;
    break;
  case 8:
    _TimeSeg1 = CAN_BS1_8TQ;
    break;
  case 9:
    _TimeSeg1 = CAN_BS1_9TQ;
    break;
  case 10:
    _TimeSeg1 = CAN_BS1_10TQ;
    break;
  case 11:
    _TimeSeg1 = CAN_BS1_11TQ;
    break;
  case 12:
    _TimeSeg1 = CAN_BS1_12TQ;
    break;
  case 13:
    _TimeSeg1 = CAN_BS1_13TQ;
    break;
  case 14:
    _TimeSeg1 = CAN_BS1_14TQ;
    break;
  case 15:
    _TimeSeg1 = CAN_BS1_15TQ;
    break;
  case 16:
    _TimeSeg1 = CAN_BS1_16TQ;
    break;
  default:
    _TimeSeg1 = CAN_BS1_1TQ;
    break;
  }

  switch (timeseg2)
  {
  case 1:
    _TimeSeg2 = CAN_BS2_1TQ;
    break;
  case 2:
    _TimeSeg2 = CAN_BS2_2TQ;
    break;
  case 3:
    _TimeSeg2 = CAN_BS2_3TQ;
    break;
  case 4:
    _TimeSeg2 = CAN_BS2_4TQ;
    break;
  case 5:
    _TimeSeg2 = CAN_BS2_5TQ;
    break;
  case 6:
    _TimeSeg2 = CAN_BS2_6TQ;
    break;
  case 7:
    _TimeSeg2 = CAN_BS2_7TQ;
    break;
  case 8:
    _TimeSeg2 = CAN_BS2_8TQ;
    break;
  default:
    _TimeSeg2 = CAN_BS2_1TQ;
    break;
  }

  _can.handle.Init.SyncJumpWidth = _SyncJumpWidth;
  _can.handle.Init.TimeSeg1 = _TimeSeg1;
  _can.handle.Init.TimeSeg2 = _TimeSeg2;
  _can.handle.Init.Prescaler = prescaler;
}

