schwinn/NMEA2000_STM32X/src/NMEA2000_STM32X.cpp
template <typename T, size_t N>
bool tNMEA2000_STM32X::lookupBaudrate(int baud, const T (&table)[N])
{
  for (size_t i = 0; i < N; i++)
  {
    if (baud != (int)table[i].baudrate)
      continue;
    setBaudRateValues(table[i].prescaler, table[i].timeseg1, table[i].timeseg2, 4);
    return true;
  }
  return false;
}

bool tNMEA2000_STM32X::calculateBaudrate(int baud)
{
  const uint32_t frequency = getCanPeripheralClock();

  if (frequency == 48000000 && lookupBaudrate(baud, BAUD_RATE_TABLE_48M))
    return true;
  if (frequency == 45000000 && lookupBaudrate(baud, BAUD_RATE_TABLE_45M))
    return true;
  if (frequency == 42000000 && lookupBaudrate(baud, BAUD_RATE_TABLE_42M))
    return true;
  if (frequency == 36000000 && lookupBaudrate(baud, BAUD_RATE_TABLE_36M))
    return true;

  // General algorithm (75–95% sample point)
  for (uint16_t prescaler = 1; prescaler <= 1024; prescaler++)
  {
    const uint32_t can_freq = frequency / prescaler;
    if (can_freq / (1 + 5 + 16) > (uint32_t)baud)
      continue;
    for (uint8_t bs2 = 1; bs2 <= 5; bs2++)
    {
      for (uint8_t bs1 = (bs2 * 3) - 1; bs1 <= 16; bs1++)
      {
        if (can_freq / (1 + bs1 + bs2) != (uint32_t)baud)
          continue;
        setBaudRateValues(prescaler, bs1, bs2, 4);
        return true;
      }
    }
  }
  return false;
}

#endif // STM32X_USE_BXCAN

// ===========================================================================
//  FDCAN – Timing algorithm
// ===========================================================================
#if defined(STM32X_USE_FDCAN)

void tNMEA2000_STM32X::subscribe()
{
  HAL_FDCAN_ActivateNotification(&hcan_, FDCAN_IT_RX_FIFO0_NEW_MESSAGE, 0);
  HAL_FDCAN_ActivateNotification(&hcan_, FDCAN_IT_TX_COMPLETE, 0x7);
}

void tNMEA2000_STM32X::unsubscribe()
{
  HAL_FDCAN_DeactivateNotification(&hcan_, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);
  HAL_FDCAN_DeactivateNotification(&hcan_, FDCAN_IT_TX_COMPLETE);
}

#if defined(RCC_PERIPHCLK_FDCAN)
#define FDCAN_PERIPH_CLK RCC_PERIPHCLK_FDCAN
#elif defined(RCC_PERIPHCLK_FDCAN1)
#define FDCAN_PERIPH_CLK RCC_PERIPHCLK_FDCAN1
#else
#error "RCC_PERIPHCLK_FDCAN not found for this STM32 family"
#endif

CanTiming tNMEA2000_STM32X::solveCanTiming(uint32_t clockFreq, uint32_t bitrate,
                                           uint8_t multiplier)
{
  // Inspired by: http://www.bittiming.can-wiki.info/
  CanTiming timing = {};
  const uint32_t baseQuanta = 16;
  uint32_t timeQuanta = baseQuanta;
  uint32_t offset = 0;
  bool found = false;

  while (offset <= 9)
  {
    timeQuanta = baseQuanta - offset;
    if (clockFreq % (bitrate * timeQuanta * multiplier) == 0)
    {
      found = true;
      break;
    }
    timeQuanta = baseQuanta + offset;
    if (clockFreq % (bitrate * timeQuanta * multiplier) == 0)
    {
      found = true;
      break;
    }
    offset++;
  }
  if (!found)
  {
#if defined(STMCANDEBUG)
    Serial.println("Error: FDCAN timing not found");
#endif
  }
  timing.prescaler = clockFreq / (bitrate * timeQuanta);
  timing.sjw = 1;
  timing.tseg1 = uint32_t(0.875f * timeQuanta) - 1;

  float sp = (1.0f + timing.tseg1) / timeQuanta;
  float sp2 = (1.0f + timing.tseg1 + 1) / timeQuanta;
  if (fabsf(sp2 - 0.875f) < fabsf(sp - 0.875f))
  {
    timing.tseg1++;
  }

  timing.tseg2 = timeQuanta - timing.tseg1 - 1;
  return timing;
}

uint32_t tNMEA2000_STM32X::lengthToDLC(uint32_t length)
{
  switch (length)
  {
  case 0:
    return FDCAN_DLC_BYTES_0;
  case 1:
    return FDCAN_DLC_BYTES_1;
  case 2:
    return FDCAN_DLC_BYTES_2;
  case 3:
    return FDCAN_DLC_BYTES_3;
  case 4:
    return FDCAN_DLC_BYTES_4;
  case 5:
    return FDCAN_DLC_BYTES_5;
  case 6:
    return FDCAN_DLC_BYTES_6;
  case 7:
    return FDCAN_DLC_BYTES_7;
  case 8:
    return FDCAN_DLC_BYTES_8;
  case 12:
    return FDCAN_DLC_BYTES_12;
  case 16:
    return FDCAN_DLC_BYTES_16;
  case 20:
    return FDCAN_DLC_BYTES_20;
  case 24:
    return FDCAN_DLC_BYTES_24;
  case 32:
    return FDCAN_DLC_BYTES_32;
  case 48:
    return FDCAN_DLC_BYTES_48;
  case 64:
    return FDCAN_DLC_BYTES_64;
  default:
    return 0;
  }
}

static uint32_t dlcToLength(uint32_t dlc)
{
  switch (dlc)
  {
  case FDCAN_DLC_BYTES_0:
    return 0;
  case FDCAN_DLC_BYTES_1:
    return 1;
  case FDCAN_DLC_BYTES_2:
    return 2;
  case FDCAN_DLC_BYTES_3:
    return 3;
  case FDCAN_DLC_BYTES_4:
    return 4;
  case FDCAN_DLC_BYTES_5:
    return 5;
  case FDCAN_DLC_BYTES_6:
    return 6;
  case FDCAN_DLC_BYTES_7:
    return 7;
  case FDCAN_DLC_BYTES_8:
    return 8;
  case FDCAN_DLC_BYTES_12:
    return 12;
  case FDCAN_DLC_BYTES_16:
    return 16;
  case FDCAN_DLC_BYTES_20:
    return 20;
  case FDCAN_DLC_BYTES_24:
    return 24;
  case FDCAN_DLC_BYTES_32:
    return 32;
  case FDCAN_DLC_BYTES_48:
    return 48;
  case FDCAN_DLC_BYTES_64:
    return 64;
  default:
    return 0;
  }
}

#endif // STM32X_USE_FDCAN

// ===========================================================================
//  Interrupt handlers
// ===========================================================================

// --- FDCAN -----------------------------------------------------------------
#if defined(STM32X_USE_FDCAN)

extern "C" void HAL_FDCAN_TxBufferCompleteCallback(FDCAN_HandleTypeDef *FDCanHandle,
                                                   uint32_t BufferIndexes)
{
  tNMEA2000_STM32X *_can = g_canInstance;
  if (_can == nullptr)
    return;
  while (HAL_FDCAN_GetTxFifoFreeLevel(FDCanHandle) > 0)
  {
    if (!_can->sendFromTxRing())
      break;
  }
}

extern "C" void HAL_FDCAN_RxFifo0Callback(FDCAN_HandleTypeDef *hfdcan,
                                          uint32_t RxFifo0ITs)
{
  tNMEA2000_STM32X *_can = g_canInstance;
  if (_can == nullptr)
    return;

  if (RxFifo0ITs & FDCAN_IT_RX_FIFO0_NEW_MESSAGE)
  {
    CAN_message_t rxmsg;
    FDCAN_RxHeaderTypeDef RxHeader = {};
    while (HAL_FDCAN_GetRxFifoFillLevel(hfdcan, FDCAN_RX_FIFO0) > 0)
    {
      if (HAL_FDCAN_GetRxMessage(hfdcan, FDCAN_RX_FIFO0, &RxHeader, rxmsg.buf) == HAL_OK)
      {
        rxmsg.id = RxHeader.Identifier;
        rxmsg.flags.extended = (RxHeader.IdType == FDCAN_EXTENDED_ID);
        rxmsg.flags.remote = (RxHeader.RxFrameType == FDCAN_REMOTE_FRAME);
        rxmsg.len = (uint8_t)dlcToLength(RxHeader.DataLength);
        _can->addToRingBuffer(rxmsg);
      }
    }
  }
}

extern "C" void FDCAN1_IT0_IRQHandler(void)
{
  HAL_FDCAN_IRQHandler(&tNMEA2000_STM32X::hcan_);
}

extern "C" void HAL_FDCAN_MspInit(FDCAN_HandleTypeDef *hfdcan)
{
  __HAL_RCC_FDCAN1_CLK_ENABLE();

  HAL_NVIC_SetPriority(FDCAN1_IT0_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(FDCAN1_IT0_IRQn);
  HAL_NVIC_SetPriority(FDCAN1_IT1_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(FDCAN1_IT1_IRQn);
}

