schwinn/NMEA2000_STM32X/src/NMEA2000_STM32X.cpp
// --- bxCAN -----------------------------------------------------------------
#else // STM32X_USE_BXCAN

extern "C" void HAL_CAN_TxMailbox0CompleteCallback(CAN_HandleTypeDef *CanHandle)
{
  tNMEA2000_STM32X *_can = (tNMEA2000_STM32X *)get_can_obj(CanHandle)->__this;
  _can->sendFromTxRing();
}
extern "C" void HAL_CAN_TxMailbox1CompleteCallback(CAN_HandleTypeDef *CanHandle)
{
  tNMEA2000_STM32X *_can = (tNMEA2000_STM32X *)get_can_obj(CanHandle)->__this;
  _can->sendFromTxRing();
}
extern "C" void HAL_CAN_TxMailbox2CompleteCallback(CAN_HandleTypeDef *CanHandle)
{
  tNMEA2000_STM32X *_can = (tNMEA2000_STM32X *)get_can_obj(CanHandle)->__this;
  _can->sendFromTxRing();
}

#if defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB) && defined(STM32_CAN_USB_WORKAROUND_POLLING)
extern "C" void HAL_CAN_RxFifo1MsgPendingCallback(CAN_HandleTypeDef *CanHandle)
#else
extern "C" void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef *CanHandle)
#endif
{
  tNMEA2000_STM32X *_can = (tNMEA2000_STM32X *)get_can_obj(CanHandle)->__this;
  CAN_message_t rxmsg;
  CAN_RxHeaderTypeDef RxHeader;

#if defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB) && defined(STM32_CAN_USB_WORKAROUND_POLLING)
  const uint32_t fifo = CAN_RX_FIFO1;
#else
  const uint32_t fifo = CAN_RX_FIFO0;
#endif

  do
  {
    if (HAL_CAN_GetRxMessage(CanHandle, fifo, &RxHeader, rxmsg.buf) == HAL_OK)
    {
      if (RxHeader.IDE == CAN_ID_STD)
      {
        rxmsg.id = RxHeader.StdId;
        rxmsg.flags.extended = 0;
      }
      else
      {
        rxmsg.id = RxHeader.ExtId;
        rxmsg.flags.extended = 1;
      }
      rxmsg.flags.remote = RxHeader.RTR;
      rxmsg.mb = RxHeader.FilterMatchIndex;
      rxmsg.timestamp = RxHeader.Timestamp;
      rxmsg.len = RxHeader.DLC;
      rxmsg.bus = get_can_obj(CanHandle)->bus;
      _can->addToRingBuffer(rxmsg);
    }
  } while (HAL_CAN_GetRxFifoFillLevel(CanHandle, fifo));
}

// --- IRQ-Handler (bxCAN) ---
#ifdef CAN1_IRQHandler_AIO
extern "C" void CAN1_IRQHandler_AIO(void)
{
  if (canObj[CAN1_INDEX])
    HAL_CAN_IRQHandler(&canObj[CAN1_INDEX]->handle);
#if defined(HAL_CEC_MODULE_ENABLED) && defined(STM32_CAN1_SHARED_WITH_CEC)
  if (phcec)
    HAL_CEC_IRQHandler(phcec);
#endif
}
#else

#if defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB) && defined(STM32_CAN_USB_WORKAROUND_POLLING)
extern "C" void CAN1_RX1_IRQHandler(void)
#else
extern "C" void CAN1_RX0_IRQHandler(void)
#endif
{
  if (canObj[CAN1_INDEX])
    HAL_CAN_IRQHandler(&canObj[CAN1_INDEX]->handle);
}

#ifdef CAN2
extern "C" void CAN2_RX0_IRQHandler(void)
{
  if (canObj[CAN2_INDEX])
    HAL_CAN_IRQHandler(&canObj[CAN2_INDEX]->handle);
}
#endif
#ifdef CAN3
extern "C" void CAN3_RX0_IRQHandler(void)
{
  if (canObj[CAN3_INDEX])
    HAL_CAN_IRQHandler(&canObj[CAN3_INDEX]->handle);
}
#endif

#if defined(STM32_CAN1_TX_RX0_BLOCKED_BY_USB) && defined(STM32_CAN_USB_WORKAROUND_POLLING)
extern "C" void STM32_CAN_Poll_IRQ_Handler(void)
#else
extern "C" void CAN1_TX_IRQHandler(void)
#endif
{
  if (canObj[CAN1_INDEX])
    HAL_CAN_IRQHandler(&canObj[CAN1_INDEX]->handle);
}

#ifdef CAN2
extern "C" void CAN2_TX_IRQHandler(void)
{
  if (canObj[CAN2_INDEX])
    HAL_CAN_IRQHandler(&canObj[CAN2_INDEX]->handle);
}
#endif
#ifdef CAN3
extern "C" void CAN3_TX_IRQHandler(void)
{
  if (canObj[CAN3_INDEX])
    HAL_CAN_IRQHandler(&canObj[CAN3_INDEX]->handle);
}
#endif

#endif // CAN1_IRQHandler_AIO

#endif // STM32X_USE_FDCAN / STM32X_USE_BXCAN
